{"intents": [
    {"tag": "salam",
        "patterns": ["Halo Ara", "Halo", "Halo", "Selamat Pagi", "Selamat Siang", "Selamat Malam", "Selamat Sore", "Salam", "Hai", "Hi", "Helo", "Hello", "Hei", "Malam", "Pagi", "Siang", "Sore"],
        "responses": ["Halo! disini Ara untuk ChatBot Pelaporan Pelecehan Seksual. Siapa korban Pelecehan Seksual yang ingin kamu laporkan?", "Selamat siang disini Ara untuk ChatBot Pelaporan Pelecehan Seksual. Apakah ada laporan pelecehan seksual?", "Selamat pagi disini Ara untuk ChatBot Pelaporan Pelecehan Seksual. Apakah anda akan melaporkan kasus pelecehan seksual yang korbannya orang lain atau anda sendiri?", "Halo! disini Ara untuk ChatBot Pelaporan Pelecehan Seksual. Apakah anda mengalami kasus pelecehan seksual?"]
    },
    {"tag": "laporDiri",
        "patterns": ["iya", "betul", "gue", "saya ingin melaporkan kasus pelecehan yang saya alami", "kasus aku sendiri", "kasus gue sendiri", "pelecehan gue sendiri", "pelecehanku", "saya mengalami pelecehan seksual", "ada seseorang berusaha melecehkan saya", "diri saya", "saya kak", "kasus saya sendiri", "saya baru saja dilecehkan", "pelecehan saya"],
        "responses": ["Ara ingin membantu, pertama Ara ingin mengetahui identitas kamu korban pelecehan seksual. Apakah kamu mengenal pelaku dan siapakah namanya?","Apakah kamu mengetahui identitas pelaku?", "Apakah kamu mengenal identitas pelaku?", "Apakah kamu mengetahui siapa namanya", "Apakah kamu memiliki hubungan dengan pelaku?", "Apakah hubungan kamu dekat dengan pelaku?", "Apakah sebelum ini, kamu memiliki masalah dengan pelaku?"]
    },
    {"tag": "laporOrang",
        "patterns": ["orang lain, seorang perempuan penumpang bus", "orang lain, seorang perempuan yang sedang menyapu", "orang lain, seorang anak perempuan berinisial", "wong liyo, seorang anak perempuan", "orang lain, seorang perempuan", "orang lain, seorang gadis berinisial", "orang lain, seorang anak laki-laki difabel inisial S", "orang lain, korbannya mahasiswi asal Toraja, EL", "orang lain, mahasiswa jawa tengah", "orang lain, korbannya bocah berisial AJ", "orang lain, korbannya seorang pria pengguna jasa layanan ojek online berinisial R", "orang lain, korbannya merupakan calon penumpang berinisial R", "orang lain, korbannya penyanyi Brisia Jodie ", "orang lain, seorang perempuan berinisial N yang menjadi korban pelecehan seksual", "korbannya seorang murid perempuan", "korbannya teman gue", "orang lain ga kenal", "saudara gue korbannya", "adik aku korbannya", "iparku korbannya", "kakakku korbannya", "ibuku korbannya", "ayahku korbannya", "rekan sekolah", "korbannya penumpang bus", "korbannya teman kerja", "korbannya teman sejawatku", "temanku korbannya", "teman dekatku korbannya", "temanku menjadi korban", "sahabatku korbannya", "orang yang aku sayang korbannya", "bestiku korbannya"],
        "responses": ["Ara ingin membantu, pertama Ara ingin mengetahui identitas kamu korban pelecehan seksual. Apakah kamu mengenal pelaku dan siapakah namanya?", "Apakah kamu mengenal identitas siapa pelaku tersebut?", "Apakah kamu memiliki hubungan dengan pelaku?", "pakah kamu bisa mendeskripsikan lebih jelas bagaimana ciri-ciri pelaku?", "Bagaimana ciri-ciri pelaku?"]
    },
    {"tag": "hubungan",
        "patterns": ["kenal, ayah tirinya", "tidak kenal identitasnya, pelakunya seorang pengendara sepeda motor datang dari arah belakang langsung memegang pantat korban", "iya aku mengenal identitasnya, pelaku pelecehan seksualnya tetangganya sendiri", "tidak kenal identitasnya, tapi pelakunya salah satu tokoh warga masyarakat desa", "pelakunya memiliki kelainan seks karena menyukai sesama jenis", "tidak mengenal identitasnya, pelaku seorang pria penumpang bus", "tentu mengenal, pelakunya tetangganya sendiri", "tidak mengenal, pelakunya pengemudi ojek online ojol", "kenal betul, pelakunya ayah tirinya", "kenal, pelakunya ayahku", "kenal, pelakunya ayahnya", "pelakunya kakeknya sendiri", "pelakunya salah satu Kru TV, Rekan kerja", "pelakunya pengendara pengemudi sepeda motor tidak dikenal", "kenal, pelakunya Asisten Pengajar Singapore American School", "kenal, pelakunya adalah guru di sekolah", "iya, pelakunya dosen pembimbing", "kenal, pelakunya adalah teman sekelas", "pelakunya adalah pacarku sendiri", "pelakunya ayahnya sendiri", "pelakunya pamanya sendiri", "pelakunya om nya sendiri", "pelaku adalah ayah tirinya", "pelaku adalah ayah kandungnya", "pelaku adalah dosennya", "pelaku adalah kepala sekolahnya", "pelaku tetangga sebelah rumahnya"],
        "responses": ["Okai, selanjutnya coba beri tahu Ara, terkait pekerjaan keseharian pelaku dan korban", "Apa pekerjaan keseharian pelaku?", "Apa kalian memiliki pekerjaan yang sama? Apakah itu?"]
    },
    {"tag": "pekerjaan",
        "patterns": ["pekerjaannya pelaku pengemudi ojek online ojol", "pekerjaan pelaku asisten pengajar", "pekerjaan pelaku", "gue ga ngerti pekerjaannya dia", "pekerjaannya seorang makelar pencari penumpang baju merah", "pekerjaannya ojek online", "pekerjaannya seorang pengacara", "pekerjaannya berdagang di pasar", "pekerjaannya guru", "pekerjaannya dosen di sebuah kampus swasta", "pekerjaannya dosen", "pekerjaannya polisi", "pekerjaannya tukang tambal ban", "kerja di bengkel", "pengangguran", "tidak kerja", "tidak bekerja", "gak punya kerjaan", "gak kerja", "pekerjaannya kuli bangunan", "sopir bus", "sopir truk angkutan"],
        "responses": ["Apakah kamu mengetahui usia pelakunya, namun apabila kamu tidak mengetahui kamu bisa memperkirakan saja", "Apakah kamu dapat memperkirakan usia pelaku?"]
    },
    {"tag": "usiaPelaku",
        "patterns": ["umurnya adalah 46 tahun", "usianya 30 tahun", "umur 40 thn", "usia pelaku 50 tahun", "usia 46 thn", "usianya 30 tahun", "usia 27 tahun", "usianya sepantaran dengan saya", "usianya sekitar beberapa tahun di atas saya", "usianya kurang lebih seumuran dengan ayah saya", "umur sekitar 30 tahun", "pelakunya sekitar umur 40 tahun", "pelaku sekitar umur 45 tahun", "pelaku sekitar umur 30 tahun", "pelaku seumuran ayah saya", "pelakunya terlihat tua"],
        "responses": ["Apa pendidikan yang ditempuh terakhir oleh pelaku?"]
    },
    {"tag": "pendidikanPelaku",
        "patterns": ["Pendidikan terakhir pelaku SMA", "Pendidikan pelaku SD", "Tidak tahu pendidikannya", "Ga ngerti pendidikan pelaku", "sepertinya lulusan SMP", "pelaku sudah sarjana", "gak tau pendidikannya", "gak tau lah", "sepertinya lulusan SMA", "sepertinya pelaku gak sekolah"],
        "responses": ["Berapakah usia korban saat mengalami pelecehan tersebut?", "Apa pendidikan terakhir yang pernah korban tempuh?"]
    },
    {"tag": "pendidikanKorban",
        "patterns": ["Korban berusia 19 tahun", "Korban berusia 17 tahun", "Korban berumur masih SD", "Korban duduk di bangku SD", "Korman masih dibangku SMP", "Korban dibangku kuliah", "Korban dibangku SMA", "Korban lulus SMA", "korban lulusan SMP", "Korban masih SD", "korbannya seorang mahasiswi", "korbannya masih SMA", "korbannya masih SD", "korbannya adalah siswa SD", "korbannya adalah anak TK", "korbannya anak SD"],
        "responses": ["Adakah korban lain pada waktu itu? Beri tahu Ara"]
    },
    {"tag": "adaKorbanLain",
        "patterns": ["iya, ada dua korban lain", "aku lihat ada satu korban lainnya", "gue lihat ada korban lain", "ada korban lain", "aku melihat ada korban lainnya", "setau saya masih ada korban lain", "banyak korban lain seperti saya", "banyak, tidak hanya saya yang menjadi korban", "tidak hanya satu korban", "korbanya lebih dari satu", "korbanya ada 2", "lebih dari dua korban", "korbanya ada tiga", "korbanya ada empat"],
        "responses": ["Siapakah korban lainnya tersebut. Apakah kamu mengenal korban lainnya?", "Apakah kamu mengenal korban lainnya?", "Apakah kamu mengenal korban bersamamu?", "Apakah kamu mengetahui siapa korban lainnya?"]
    },
    {"tag": "korbanLain",
        "patterns": ["aku tidak mengenal korban lainnya", "Muridnya menjadi korban lainnya", "Korban lain tetangganya", "penumpang lain juga menjadi korban", "Nama korban lainnya", "Mengenal korban lainnya", "Korban lainnya", "Teman saya juga menjadi korban"],
        "responses": ["Baik selanjutnya, kamu dapat menceritakan kronologis/cerita singkat kejadian (apa yang terjadi, kapan, dimana dan bagaimana terjadinya?"]
    },
    {"tag": "tidakadaKorbanLain",
        "patterns": ["tidak ada korban lainnya", "ga ada korban lainnya", "tidak ada korban lain", "udah, itu aja", "cuma itu", "hanya itu", "itu aja"],
        "responses": ["Baik selanjutnya, kamu dapat menceritakan kronologis/cerita singkat kejadian (apa yang terjadi, kapan, dimana dan bagaimana terjadinya?"]
    },
    {"tag": "kronologi",
        "patterns": ["Keluarga awalnya curiga karena perilaku anak ini berubah. Biasanya ceria, tiba-tiba pendiam dan murung. Ditanya kenapa sama keluarga, ceritalah korban, pelaku melakukan aksinya selama kurun waktu", "Malam kejadian, korban diantar pelaku ke rumah orangtuanya. Pelaku menyebutkan bahwa korban ditiduri oleh pria berinisial JT. Namun, orangtua korban tak mudah percaya. Setelah pelaku pulang, korban ditanya dan ternyata pengakuan korban yang menidurinya adalah pelaku", "tersangka Ar mengaku melakukan perbuatan itu pertama kali saat melihat korban S sedang jajan di warung tak jauh dari rumahnya. Ia kemudian berpura-pura mengajak korban makan dan membawanya ke rumah untuk dicabuli. Saat itu, korban mendapat kekerasan dari pelaku karena menolak dicabuli", "kejadian berawal saat adiknya naik bus dari Makassar menuju Toraja. Namun, pada saat di perjalanan bus mengalami mogok. Kemudian penumpang dipindahkan ke bus lainnya dan korban duduk disamping pelaku.Dalam perjalanan suasana berjalan normal, korban sempat berbincang dengan pelaku tentang keluarganya. Pelaku sempat bercerita kalau dia juga punya anak yang seumuran dengan korban. Tak lama setelah itu, korban tidur dan pelaku beraksi dengan cara meraba-raba bagian paha dan alat vital korban. Setelah tersadar korban syok dan tak tahu harus berbuat apa. Dalam kondisi tidur, tiba-tiba ia bangun karena merasa di aba-raba sama pelaku yang duduk di sampingnya. Adik saya langsung menghindar. Dia mau minta tolong tapi katanya tidak bisa, mungkin karena syok,d ucap Fidelis. Saat bus tiba di persinggahan, korban menyampaikan ke sopir tentang kejadian yang dialaminya, sehingga korban dipindahkan duduk kursi samping sopir. Setelah tiba di Toraja, korban bersama keluarganya langsung melapor ke Polres Toraja Utara. Namun laporan korban ditolak oleh Polisi.", "Mulanya korban keluar rumah sejak Kamis pagi. Namun, setelah pergi lama dan belum kembali, ibu korban pun langsung mencari. Setelah mencari ke tetangga, ibu korban melihat sandal anaknya ada di depan rumah pelaku. Lalu ibunya korban langsung mengetuk-mengetuk rumah pelaku. Namun, pelaku tidak membuka pintu rumahnya. Ibu korban kemudian memanggil-manggil korban agar keluar karena terdengar suara jeritan.", "Saya awalnya iseng nyalain aplikasi di Pasar Minggu habis dari rumah teman. Terus dapat order ke arah Cipete Utara. Saya klik dan diterima orderan-nya. Calon penumpang itu mengakui lewat percakapan di aplikasi bahwa orderannya bodong. Calon penumpang berinisial R itu bukan memesan layanan ojek online untuk diantar ke suatu tempat. R justru mengajak J untuk berhubungan badan. Lantas, J pun menanggapi pelecehan itu dengan mengajak R ke kantor polisi. Lalu saya balas chat-nya, ayo ke polsek terdekat saja. Selamat Anda terlacak dan masuk Daftar Pencarian Orang. Eh enggak dibalas.", "Saat ia sedang menunggu giliran untuk bernyanyi di atas panggung. Jodie hendak membawakan lagu duetnya bersama Arsy, 'Rindu Dalam Hati'. Jadi Arsy di panggung duluan, kan nyanyi part pertama Rindu Dalam Hati tuh, terus kan aku lagi nunggu di belakang. Saat Jodie menunggu giliran bernyanyi, seorang floor director (FD) berbicara padanya. Mulanya hanya basa-basi tak menyangka bahwa sosok di balik layar adalah dirinya. Namun kru TV itu lanjut menyinggung soal berat badan Jodie hingga mengarah pada pelecehan seksual verbal.", "Saat itu korban lagi nyapu, itu kan di gang, tiba-tiba pelaku masuk ke gang itu, terus melakukan hal itu (memegang pantat korban) lalu pergi", "MN diperkosa oleh JP saat istrinya pergi ke pasar untuk berjualan. Saat kejadian, MN dipaksa melayani hawa nafsunya dengan iming-iming akan dibelikan kuota internet. Saat korban menolak, pelaku masih tetap memaksa. Dari keterangan korban, dia sudah berulang kali diperkosa ayah tirinya. Dia tega memperkosa anak tirinya karena sudah lama tidak berhubungan badan dengan istrinya. Setiap saya minta jatah tidak dikasih dan selalu marah-marah. Jadi saya melakukan seperti ini", "kejadian ini terjadi ketika saya di sekolah", "ketika kembali dari sekolah suatu hari", "seorang pria di sepeda mulai mengikuti saya", "sampai ke gedung saya ini mulai terjadi setiap hari", "sampai saya mengeluh kepada orang tua saya.", "Sahabat saya dilecehkan secara seksual oleh tetangganya ketika dia berusia enam tahun Dia masih tinggal di sebelahnya dan belum memberi tahu siapa pun tentang hal itu.", "Saya dilecehkan saat bermain basket dengan anak laki-laki dan tidak ada anak perempuan untuk bermain.", "pria itu mencoba menganiaya saya dengan menyentuh saya secara fisik.", "kakak ipar diperkosa dan dibunuh oleh ipar di dekat rumah.", "2 orang naik sepeda tiba-tiba datang dari belakang", "mendorong saudara saya dan menyambar rantai dari leher ibu saya.", "Saya diperkosa di taman.", "Saya sedang berjalan di sepanjang jalur Jogging di End point Seorang pria melangkah keluar dari balik semak", "masturbasi dan menyeringai Dia mengenakan jeans biru", "T-shirt putih dan tampak berusia 20-an.", "Seorang pria membuatku menyentuh kemaluannya di dalam lift.", "Ketika saya di sekolah guru sosial saya sering menyentuh punggung saya dan saya merasa tidak nyaman dengan itu Saat itu saya tidak tahu kalau itu pelecehan.", "Saya sedang kembali ke rumah saya mengendarai sepeda ketika saya hampir dekat rumah saya kemudian tiba-tiba beberapa orang asing datang di depannya dan mulai berkomentar.", "ketika saya akan kembali ke rumah ada beberapa orang yang sedang duduk di dalam mobil ketika mereka melihat saya mereka mulai mengikuti saya dan memberikan beberapa komentar.", "saya bepergian dengan bus dari kampus saya ke rumah itu terlalu padat Seorang pria yang berdiri di punggung saya menjebak saya di antara tangannya saya merasa sangat tidak nyaman dan memintanya untuk melepaskan tangannya.", "BIKERS LEWATKAN DIPERLAKUKAN.", "Ini terjadi di kereta dari CST ke Panvel Saya berada di Std 7 atau 8 ketika di kompartemen umum kereta", "seorang pria menggerakkan jarinya secara tidak tepat ketika saya berdiri di dekatnya.", "Saat festival kampus", "saya mengundang salah satu teman Muslim saya", "dia biasanya berdandan sederhana dan biasa saja Dia juga memakai burkha Dia mengeluh kepada saya bahwa beberapa anak laki-laki memberikan komentar tidak senonoh dan bersiul padanya.", "Saya sedang pergi ke sekolah ketika seorang asing datang dari depan memukul saya.", "di navratri pandal pada tahun 2010.", "Saya akan menghadiri Durga Pooja ketika seorang pria mencoba menyentuh tangan saya.", "Saya bersama sepupu saya di arena bermain dekat foodcourt Kami sedang go-karting dan seorang pria mulai merekam kami Saya tidak sadar sampai paman saya pergi ke pria itu dan menghancurkan teleponnya.", "Pelecehan seksual oleh seorang pria usia 25", "dia adalah orang yang tidak stabil secara mental dan membuntuti saya sepanjang waktu.", "sekali di sebuah desa seorang gadis diperkosa terlebih dahulu dan dibunuh setelah itu tapi tidak ada yang melakukan apa pun pada terpidana tubuhnya dipotong dan dipisahkan.", "temanku tersentuh di dada oleh bosnya sendiri MD.", "saya tersentuh oleh seorang pria di dalam bus.", "mobil berhenti dengan pura-pura menanyakan arah", "kemudian anak laki-laki itu menawari saya tumpangan yang tidak diinginkan", "ketika ditolak mereka mengikuti saya sampai saya berlindung di tempat ramai yang aman.", "sedang berdiri memegang bagian belakang kursi ketika orang ini tahu meletakkan tangannya di tanganku.", "seorang anak laki-laki mencoba menyentuh saya.", "Teman saya disentuh di tempat yang tidak pantas oleh sepupunya ketika dia pergi mengunjungi mereka.", "Sekitar satu tahun yang lalu", "saya pergi ke toko terdekat di Aiyappa Society", "Madhapur", "Hyderabad Jalanan gelap karena tidak ada lampu jalan", "tiba-tiba seorang pria datang dengan sepeda dan meraba-raba saya.", "Saat itu sekitar jam 5:00 sore ketika saya menuju pasar sekelompok anak laki-laki melewati saya mengenakan capree dan kemudian mereka berkomentar &quot;inse chote kapde ni mile&quot;.", "2-3 pria besar datang berjalan ke kami menanyakan nama kami dan kemudian menggoda dan mengikuti.", "Dia kembali ke rumah ketika orang asing yang lewat memukulnya.", "Ada dua anak laki-laki dengan es krim di Activa saya tidak memakai helm dan scooty Mereka mencoba memasukkan es krim mereka ke dalam mulutku dan kemudian mereka menguntit sampai rumah.", "Setelah tidak ada listrik di rumah saya kemudian saya sedang tidur di teras ketika seorang anak laki-laki dari multipleks di belakang rumah saya berkomentar.", "Terganggu oleh orang-orang yang berkomentar dan menatap.", "Seseorang menyentuh saya di tempat yang sangat salah ketika saya bepergian dengan bus dalam perjalanan pulang.", "Saya akan kembali dari pelatihan saya ke hme sekelompok 3-4 anak laki-laki berdiri dan berkomentar liar meminta saya untuk menemani mereka.", "Pria menggenggam payudaraku.", "Ketika saya sedang dalam perjalanan ke sekolah", "seorang pria mulai berkomentar dan menyentuh saya.", "Saat itu selama festival jalanan di boudha", "jalanan sangat ramai dan saya dilecehkan.", "berjalan di jalan sambil pergi ke kelas.", "Saat aku duduk di bangku kelas 9", "saat jam istirahat salah satu anak sekolah kami menyentuhku di dekat perutku Saya harus mengeluh kepada Kepala Sekolah saya dan dia mengambil tindakan tegas.", "saya bersama teman saya di dekat halte bus ITO seseorang berkomentar padanya", "dengan cara yang sangat canggung.", "Disentuh dan Diraba-raba.", "ada paman di atas skuter yang mengikuti saya dan kemudian tiba-tiba berhenti di depan", "memberikan komentar cabul tetapi yang paling menjijikkan dari semua itu dia mengekspos bagian pribadinya di sana!.", "pelecehan di pagi hari.", "Di kampus", "teman satu angkatan kami biasa menyanyikan lagu atau mengomentari sosok kami yang mengundang kencan atau menggoda kami.", "Ketika saya pergi ke kelas saya", "seorang anak laki-laki mengikuti saya dari rumah saya sampai kelas saya dengan sepedanya sambil berkata &quot;Beri aku nomormu", "maukah kamu menjadi temanku", "Kasus guru laki-laki mencoba menawarkan nilai yang lebih baik di perguruan tinggi dan juga kasus laki-laki masturbasi di depan umum."],
        "responses": ["Ara masih belum mengetahui letak kejadiannya, dimana alamat tempat tinggal atau tempat kejadian? Dapat berupa kecamatan dan kabupatennya"]
    },
    {"tag": "bye",
        "patterns": ["Terima kasih", "Terimakasih Ara", "Thenkyou", "Thenks", "Dadah", "Selamat Tinggal", "Dah", "Daah", "Semoga harimu menyenangkan", "Ok makasih", "Ok bye", "makasih banyak", "makasi", "Oke", "Ok", "tengkyu", "trimakasih", "Ya"],
        "responses": ["Terimakasih sudah melaporkan tindakan pelecehan seksual yang terjadi. Let's being this world better, no more silence and stop the violence", "Kalau ada masalah dan enggan menceritakan ke orang lain, hubungi Ara lagi ya. World be better if we no more silence and stop the violence", "Semangat, semoga harimu kedepannya lebih baik! I believe you can be best version peson"]
    }
]
}